-- 1. Выполнить данные запросы:
Create database B1;
use b1;
CREATE TABLE Basic (
    SongTitle VARCHAR(35),
    Quality varchar(1),
    Duration INT,
    DateRecord DATE,
    AlbumTitle varchar(35), 
    price decimal (5,2),
    ArtistName varchar(35),
    `e-mail` varchar(35)
    );
insert into Basic (SongTitle, Quality, Duration, DateRecord, AlbumTitle, price, ArtistName, `e-mail`) values 
('Sing Me To Sleep', 'H', 176, '2018-08-29',null, null, 'Alan Walke', 'AlanWalker@mail.com'),
('The Greatest', 'L', 88, '2019-10-24', 'The Greatest', 2.38, 'Sia', null),
('Cheap Thrills', 'M', 115, '2016-07-16', 'The Greatest', 2.38, 'Sia', null),
('Ocean Drive', 'M', 101,	'2015-12-04', null, null, 'Duke Dumont', null),
('No Money', 'M',	126, '2018-05-11', 'In The Lonely Hour', 3.63, null, null),
('Thinking About It', 'L', 170, '2016-01-14', 'Evolution', 1.88, 'Nathan Goshen', null),
('Perfect Strangers', 'L', 189, '2018-09-06', 'Runway', 2.75, 'Jonas Blue', null),
('Perfect Strangers', 'L', 189, '2018-09-06', 'Runway', 2.75, 'Jp Cooper', null),
('Thinking About It', 'M', 179, '2017-10-25','In The Lonely Hour',3.25, 'Alan Walke', 'AlanWalker@mail.com'),
('Thinking About It', 'M', 179, '2017-10-25','In The Lonely Hour',3.25, 'Jp Cooper', null),
('My Way', 'H', 163, '2018-07-26','My Way', 1.63, 'Frank Sinatra', null),	
('My Way', 'H', 157,	'1985-01-11','The Christmas', 3.63, 'Frank Sinatra', null),
('Let It Snow!', 'M', 158, '1984-03-05','World On A String', 3.38, 'Frank Sinatra', null);

-- 2. Нормальзвать базу данных. Создать новые таблицы (назания полей взять из таблицы Basic).
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 3. Заполнить полученые таблицы с помощью запросов из таблицы Basic
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- далее работать с таблицей basic не допускается!
-- ----------------------------------------------------------------------

-- 4. Вывести поля: SongTitle, Quality, Duration, DateRecord, AlbumTitle, 
-- price, ArtistName, `e-mail` из полученных в ходе нормализации таблиц
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 5. Добавить новую компазицию - назание: "Can't Stop The Feeling", исполнителя: "Jonas Blue", 
-- продолжительностью 253 секунды, качество - "M", в "DateRecord" указать текущию дату.
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 6. Переименовать аудио запасись "Thinking About It" исполнитля "Nathan Goshen" в "Let It Go"
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 7. Удалить колонку "e-mail", создать колонку "Сайт", задав по умолчанию значение «нет»
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 8. Вывести все аудио запасиси, отобразив, если имеется, имя исполнится и альбом
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 9. Вывести все аудио запасиси, у которых в названии альбома есть «way» 
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 10. Вывести: название, стоимость альбома и его исполнителя при условии, 
-- что он будет самым дорогим для каждого исполнителя.
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 11. Удалить запись "Can't Stop The Feeling" исполнителя "Jonas Blue".
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 12.	Вывести название и качество записи трека отсортировав 
-- сначала по качеству, затем по названию (обратный порядок), не включая плохие записи.
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 13.	Создать хранимую процедуру для вывода названия и цены трех самых дешевых альбомов.
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 14.	Вывести альбом второй по стоимости после самого дорогого альбома.
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 15.	Найти альбом, у которого нет исполнителя.
-- ----------------------------------------------------------------------
-- Решение:

-- ----------------------------------------------------------------------
-- 16.	Найти треки, у которых название начинается не с букв.
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 17.	Найти все треки, которые начинаются на гласные буквы.
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- 18.	Создать хранимую процедуру для вывода названия альбома которые начинаются на указанную букву 
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------
-- *** Создать хранимую процедуру для одновременного добавления информации в таблицы новой записи 
-- (название альбома, исполнитель, название трека, продолжительность). 
-- Перед добавлением записи выполнять проверку на появление возможных ошибок в базе данных.  
-- ----------------------------------------------------------------------
-- Решение:


-- ----------------------------------------------------------------------